---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Macros.UIMacroManager
source: html/6771a338-367f-6dd8-68ed-8153bdab3f18.htm
---
# UIMacroManager Members

Adds a MacroModule to the application or document.